In [85]:
import pandas as pd

file_path = '/Users/hananalaskar/Documents/Code for Girls/data-science/Hanan_updated_version/data_set' # change it later
df = pd.read_csv(file_path+'/ds_salaries_messy.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Research Scientist,85000,EUR,FR,50,FR,L
1,2021,MI,FT,Data Engineer,110000,PLN,PL,100,PL,L
2,2022,MI,FT,Data Engineer,40000,NaN,GB,0,GB,M
3,2022,SE,FT,Data Analyst,132000,USD,US,0,US,M
4,2022,SE,FT,Data Engineer,100000,USD,US,100,US,M

In [86]:
df.shape

(607, 10)

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    605 non-null    object
 2   employment_type     588 non-null    object
 3   job_title           607 non-null    object
 4   salary              607 non-null    int64
 5   salary_currency     595 non-null    object
 6   employee_residence  607 non-null    object
 7   remote_ratio        607 non-null    int64
 8   company_location    607 non-null    object
 9   company_size        607 non-null    object
dtypes: int64(3), object(7)
memory usage: 47.5+ KB

In [88]:
df = df.loc[df['experience_level'] == df['experience_level']]
df.shape

(605, 10)

In [89]:
df = df.loc[df['employment_type'] == df['employment_type']]
df.shape

(586, 10)

In [90]:
df = df.loc[df['salary_currency'] == df['salary_currency']]
df.shape

(574, 10)

In [ ]:
df.info()

In [91]:
df.describe()

         work_year        salary  remote_ratio
count   574.000000  5.740000e+02    574.000000
mean   2021.407666  3.355000e+05     72.702091
std       0.692274  1.587122e+06     44.142204
min    2020.000000  4.000000e+03    -10.000000
25%    2021.000000  7.050000e+04     50.000000
50%    2022.000000  1.150000e+05    100.000000
75%    2022.000000  1.649990e+05    100.000000
max    2022.000000  3.040000e+07    296.000000

In [92]:
df['remote_ratio'].unique()

array([ 50, 100,   0, 225, 182,  -8, 103,  -2, 293, 164,  -1, 144, 193,
       155, 296, 116,  -4,  -7, -10])

In [93]:
df = df.loc[(df['remote_ratio'] > -1) &  (df['remote_ratio'] < 101) ]
df.shape

(554, 10)

In [94]:
df['remote_ratio'].unique()

array([ 50, 100,   0])

In [ ]:
df.shape

In [ ]:
q_1 = df["salary"].quantile(0.25)
q_3 = df["salary"].quantile(0.75)
iqr = q_3 - q_1

l_q = q_1 - (1.5 * iqr)
h_q = q_3 + (1.5 * iqr)

In [95]:
df = df[(df["salary"] > l_q) & (df["salary"] < h_q)  ]

In [96]:
df.shape

(512, 10)

In [97]:
df[(df["salary"] < l_q) | (df["salary"] > h_q)  ]

Empty DataFrame
Columns: [work_year, experience_level, employment_type, job_title, salary, salary_currency, employee_residence, remote_ratio, company_location, company_size]
Index: []

In [98]:
df[df.duplicated()].shape

(37, 10)

In [99]:
df = df.drop_duplicates()

In [100]:
df.shape

(475, 10)